BOT_TRIGGER_TEXT = "بوت"
EDIT_COMMAND_TEXT = "ادت"
VOICE_EDIT_TEXT = "تعديل"
START_CONVERT_TEXT = "بدء"

EDIT_MESSAGE_TEXT = (
    "تستطيع تعديل مدة البوت كما ادناه\n"
    "اضغط على الزر"
)

EDIT_GUIDE_BUTTON_TEXT = "اطلاع"

EDIT_GUIDE_ALERT_TEXT = (
    "فواصل التوقيتان هما - و / ويلزم ان يكون ماقبلهم وبعدهم مسافه "
    "ويقبل المسافة ايضا بدون رموز ك فاصل توقيتي وتكون صيغه التعديل هكذا\n\n"
    "للثوانِ يقبل\n"
    "0:12 / 0:24 ويقبل 12 / 24\n"
    "للدقائق يقبل\n"
    "01:24 / 02:30 ويقبل 1:24 / 2:30\n"
    "ويقبل 04:09 / 08:04 ويقبل\n"
    "4:9 / 8:4\n"
    "ونفس الشيء للثوانِ ايضا\n\n"
    "ولا يلزم ان يكون التوقيتان متشابهان للبدايه والنهاية، الصيغ و AbbreViATioNs كلها تعمل"
)

BUTTON_VOICE_TEXT = "فويس"
BUTTON_NORMAL_TEXT = "نورمال"

NO_PERMISSION_ALERT = "ليس مسموح لك القيام\nبهذا التغيير"

DOWNLOAD_START_TEXT = "تدلل دامص بعيرك مولاي\nاروح فدوا"
DOWNLOAD_FAILED_TEXT = "الرابط غير مدعوم او الموقع مو راضي يتعاون\nالعق عيري يلا"

TAKEOFF_TEXT = "اشتغل البوت مرتلخ\nتع امص"

OWNER_BUTTON_NAMES = ["المالك", "المطور", "المنشئ"]

ROTATING_RESPONSES = [
    "اهلين وسهلين\nاستاذ/ة",
    "مو ناوي تستعملني مثل البوتات ترى بس اضوج\nينتفخ ديسي",
    "ترى يمكن انطيك بلوك\nواعوفك ملبوس",
    "راح انزع وتنيكني بدال هذا الاستنياج\nشو داضوج",
    "ترى امص عيرك ماتنيكني وتضرط طيزي\nوتفوخ كسي",
]
