COMMAND_SETTINGS = "ادت"
COMMAND_BOT = "بوت"

MODE_VOICE = "فويس"
MODE_NORMAL = "نورمال"

DYNAMIC_BUTTON_NAMES = (
    "المنشئ",
     "المطور",
    "المالك",
)

SETTINGS_TEXT = "تستطيع تغيير وضع عمل البوت\nمن هنا"
SETTINGS_UNAUTHORIZED = "ليس مسموح لك القيام\nبهذا التغيير"

STARTUP_TEXT = "اشتغل البوت مرتلخ\nتع امص"

DOWNLOAD_STARTED = "تدلل دامص بعيرك مولاي\nاروح فدوا"
DOWNLOAD_FAILED = "الرابط غير مدعوم او الموقع مو راضي يتعاون\nالعق عيري يلا"

ROTATING_RESPONSES = (
    "اهلين وسهلين\nاستاذ/ة",
    "مو ناوي تستعملني مثل البوتات ترى بس اضوج\nينتفخ ديسي",
    "ترى يمكن انطيك بلوك\nواعوفك ملبوس",
    "راح انزع وتنيكني بدال هذا الاستنياج\nشو داضوج",
    "ترى امص عيرك ماتنيكني وتضرط طيزي\nوتفوخ كسي",
)
