ROTATING_REPLIES = [
    "اهلين وسهلين\nاستاذ/ة",
    "مو ناوي تستعملني مثل البوتات ترى بس اضوج\nينتفخ ديسي",
    "ترى يمكن انطيك بلوك\nواعوفك ملبوس",
    "راح انزع وتنيكني بدال هذا الاستنياج\nشو داضوج",
    "ترى امص عيرك ماتنيكني وتضرط طيزي\nوتفوخ كسي",
]

STARTUP_MESSAGE = "اشتغل البوت مرتلخ\nتع امص"

DOWNLOAD_START_REPLY = "تدلل دامص بعيرك مولاي\nاروح فدوا"

DOWNLOAD_FAIL_REPLY = "الرابط غير مدعوم او الموقع مو راضي يتعاون\nالعق عيري يلا"

ADMIN_ALERT_TEXT = "ليس مسموح لك القيام\nبهذا التغيير"

EDIT_TEXT = "تستطيع تغيير وضع عمل البوت\nمن هنا"

BTN_VOICE = "فويس"
BTN_NORMAL = "نورمال"

BTN_NAMES = ["المالك", "المطور", "المنشئ"]

CMD_EDIT = "ادت"
CMD_BOT = "بوت"
