COMMAND_SETTINGS = "ادت"
COMMAND_BOT = "بوت"
COMMAND_EDIT = "تعديل"

MODE_VOICE = "فويس"
MODE_NORMAL = "نورمال"

DYNAMIC_BUTTON_NAMES = (
     "المنشئ",
    "المطور",
      "المالك",
)

SETTINGS_TEXT = "تستطيع تغيير وضع عمل البوت\nمن هنا"
SETTINGS_UNAUTHORIZED = "ليس مسموح لك القيام\nبهذا التغيير"

STARTUP_TEXT = "اشتغل البوت مرتلخ\nتع امص"

DOWNLOAD_STARTED = "تدلل دامص بعيرك مولاي\nاروح فدوا"
DOWNLOAD_FAILED = "الرابط غير مدعوم او الموقع مو راضي يتعاون\nالعق عيري يلا"

ROTATING_RESPONSES = (
    "اهلين وسهلين\nاستاذ/ة",
    "مو ناوي تستعملني مثل البوتات ترى بس اضوج\nينتفخ ديسي",
    "ترى يمكن انطيك بلوك\nواعوفك ملبوس",
    "راح انزع وتنيكني بدال هذا الاستنياج\nشو داضوج",
    "ترى امص عيرك ماتنيكني وتضرط طيزي\nوتفوخ كسي",
)

EDIT_PROMPT = (
    "الفواصل الزمنيه مابين التوقيتين\n"
    "يقبل / و - ويلزم ان يكون ماقبلهم وبعدهم\n"
    "مسافة\n"
    "يقبل المسافة دون رمز ك فاصل زمني ايضا\n\n"
    "للثوانِ 00 / 00\n"
    "وهكذا 00:00 و 00:0 و 0:00 و 0:0 بشرط ان تبدء بصفر للتمييز بين الثوانِ والدقائق ولا يشترط كتابه صفر عند بداية المدة للأرقام الفردية"
)

EDIT_START_AFTER_END = (
    "مدة البدايه اكبر من مدة النهايه\n"
    "مرفوض"
)

EDIT_FAILED = (
    "المدة غير مدعومه او ان الفويس غير صالح\n"
    "المعذرة"
)