CMD_SETTINGS = "ادت"
TRIGGER_WORD = "بوت"

MODE_VOICE = "فويس"
MODE_NORMAL = "نورمال"

SETTINGS_TEXT = "تستطيع تغيير وضع عمل البوت\nمن هنا"
SETTINGS_UNAUTHORIZED = "ليس مسموح لك القيام\nبهذا التغيير"

BUTTON_NAMES = (
   "المنشئ",
    "المطور",
     "المالك",
)

ROTATING_RESPONSES = [
    "اهلين وسهلين\nاستاذ/ة",
    "مو ناوي تستعملني مثل البوتات ترى بس اضوج\nينتفخ ديسي",
    "ترى يمكن انطيك بلوك\nواعوفك ملبوس",
    "راح أضوج وأعوفك، شو داضوج",
    "ترى راح أزعلك وأطردك من عندي\nوتفوخ كسي",
]

DOWNLOAD_START =
    "تدلل دامص بعيرك مولاي\n"
    "اروح فدوا"
    
DOWNLOAD_FAILED =
    "الرابط غير مدعوم او الموقع مو راضي يتعاون\n"
    "العق عيري يلا"