EDIT_COMMAND = "ادت"
BOT_COMMAND = "بوت"

BTN_VOICE = "فويس"
BTN_NORMAL = "نورمال"

BTN_NAMES = ["المالك", "المطور", "المنشئ"]

TEXT_EDIT_RESPONSE = "تستطيع تغيير وضع عمل البوت\nمن هنا"

TEXT_START_DOWNLOAD = "تدلل دامص بعيرك مولاي\nاروح فدوا"

TEXT_FAIL_DOWNLOAD = "الرابط غير مدعوم او الموقع مو راضي يتعاون\nالعق عيري يلا"

TEXT_ALERT_UNAUTHORIZED = "ليس مسموح لك القيام\nبهذا التغيير"

TEXT_TAKEOFF = "اشتغل البوت مرتلخ\nتع امص"

ROTATING_REPLIES = [
    "اهلين وسهلين\nاستاذ/ة",
    "مو ناوي تستعملني مثل البوتات ترى بس اضوج\nينتفخ ديسي",
    "ترى يمكن انطيك بلوك\nواعوفك ملبوس",
    "راح انزع وتنيكني بدال هذا الاستنياج\nشو داضوج",
    "ترى امص عيرك ماتنيكني وتضرط طيزي\nوتفوخ كسي"
]
