VOICE_BUTTON = "فويس"
NORMAL_BUTTON = "نورمال"
DEVELOPER_BUTTON_NAMES = (
    "المالك",
    "المطور",
    "المنشئ",
)

EDIT_WORD = "ادت"

BOT_WORD = "بوت"

MODE_TEXT = (
    "تستطيع تغيير وضع عمل البوت\n"
    "من هنا"
)

UNAUTHORIZED_MODE_TEXT = (
    "ليس مسموح لك القيام\n"
    "بهذا التغيير"
)

STARTUP_TEXT = (
    "اشتغل البوت مرتلخ\n"
    "تع امص"
)

START_DOWNLOAD_TEXT = (
    "تدلل دامص بعيرك مولاي\n"
    "اروح فدوا"
)

DOWNLOAD_FAILED_TEXT = (
    "الرابط غير مدعوم او الموقع مو راضي يتعاون\n"
    "العق عيري يلا"
)

ROTATING_REPLIES = (
    "اهلين وسهلين\nاستاذ/ة",
    "مو ناوي تستعملني مثل البوتات ترى بس اضوج\n"
    "ينتفخ ديسي",
    "ترى يمكن انطيك بلوك\n"
    "واعوفك ملبوس",
    "راح انزع وتنيكني بدال هذا الاستنياج\n"
    "شو داضوج",
    "ترى امص عيرك ماتنيكني وتضرط طيزي\n"
    "وتفوخ كسي",
)
